// TODO изменить логику, чтобы подходило не только к тестам с пятью вопросами?

const finalData = [
    {
        rightAnswers: [5],
        data: {
            title: "Поздравляем!",
            label: "Вы вырастили большое и здоровое дерево!",
            text: "Вы можете продолжить изучение материала в следующем разделе.",
        },
    },
    {
        rightAnswers: [3, 4],
        data: {
            title: "Поздравляем!",
            label: "Ваше дерево выглядит совсем неплохо, но ему есть куда расти!",
            text: "Советуем ознакомиться с этими разделами для восполнения недостающих знаний:",
        },
    },
    {
        rightAnswers: [1, 2, 0],
        data: {
            title: "Ой, ваше дерево совсем не выросло!",
            label: "Ему нужен уход, внимание и забота!",
            text: "А чтобы получить необходимые для этого знания, советуем ознакомиться с этими разделами:",
        },
    },
]

// TODO заполнить правильные данные для всех тестов

const testsQsData = {
    1: [
        {
            id: 1,
            title: "Что значат буквы E, S, G в аббревиатуре ESG?",
            correct: 2,
            wrongAnswerSectId: 4,
            items: [
                {
                    id: 1,
                    text: "E – этика, S – социальные аспекты, G – государственное управление",
                },
                {
                    id: 2,
                    text: "E – экология, S – социальные аспекты, G – корпоративное управление",
                },
                {
                    id: 3,
                    text: "E – естественное развитие, S – социальные вопросы, G – управление",
                },
            ],
        },
        {
            id: 2,
            title: "Когда появились первые законы об охране окружающей среды?",
            correct: 2,
            wrongAnswerSectId: 4,
            items: [
                {
                    id: 1,
                    text: "Когда появились первые законы об охране окружающей среды?",
                },
                {
                    id: 2,
                    text: "В ХIХ веке",
                },
                {
                    id: 3,
                    text: "В 90-х годах ХХ века",
                },
            ],
        },
        {
            id: 3,
            title: "На заводах в Волхове и Балакове мы достигли?",
            correct: 2,
            wrongAnswerSectId: 4,
            items: [
                {
                    id: 1,
                    text: "100% переработки отходов",
                },
                {
                    id: 2,
                    text: "Почти нулевого сброса сточных вод",
                },
                {
                    id: 3,
                    text: "Сокращения выбросов парниковых газов на 30%",
                },
            ],
        },
        {
            id: 4,
            title: "В компании реализуется проект по охране труда, который называется?",
            correct: 2,
            wrongAnswerSectId: 4,
            items: [
                {
                    id: 1,
                    text: "Трансформация культуры безопасности ",
                },
                {
                    id: 2,
                    text: "Модернизация охраны труда",
                },
                {
                    id: 3,
                    text: "Охрана труда",
                },
            ],
        },
        {
            id: 5,
            title: "Компания распространяет требования ESG на поставщиков и потребителей, используя какие инструменты?",
            correct: 2,
            wrongAnswerSectId: 4,
            items: [
                {
                    id: 1,
                    text: "ESG рейтинги",
                },
                {
                    id: 2,
                    text: "ESG оценку поставщиков и зеленые стандарты продукции",
                },
                {
                    id: 3,
                    text: "Телефонные конференции",
                },
            ],
        },
    ],
    2: [
        {
            id: 1,
            title: "Сколько целей устойчивого развития ООН принято в 2015 году?",
            correct: 2,
            wrongAnswerSectId: 4,
            items: [
                {
                    id: 1,
                    text: "15",
                },
                {
                    id: 2,
                    text: "18",
                },
                {
                    id: 3,
                    text: "17",
                },
            ],
        },
        {
            id: 2,
            title: "В каком году ФосАгро выделила для себя приоритетные цели устойчивого развития?",
            correct: 2,
            wrongAnswerSectId: 4,
            items: [
                {
                    id: 1,
                    text: "2020",
                },
                {
                    id: 2,
                    text: "2019",
                },
                {
                    id: 3,
                    text: "2018",
                },
            ],
        },
        {
            id: 3,
            title: "Сколько целей устойчивого развития ФосАгро определила как приоритетные?",
            correct: 2,
            wrongAnswerSectId: 4,
            items: [
                {
                    id: 1,
                    text: "17",
                },
                {
                    id: 2,
                    text: "13",
                },
                {
                    id: 3,
                    text: "11",
                },
            ],
        },
        {
            id: 4,
            title: "Является ли компания участником глобального договора ООН? ",
            correct: 2,
            wrongAnswerSectId: 4,
            items: [
                {
                    id: 1,
                    text: "Да",
                },
                {
                    id: 2,
                    text: "Да, в статусе «лидера»",
                },
                {
                    id: 3,
                    text: "Нет",
                },
            ],
        },
        {
            id: 5,
            title: "Основная мыслль доклада «Пределы роста»",
            correct: 2,
            wrongAnswerSectId: 4,
            items: [
                {
                    id: 1,
                    text: "Ресурсы планеты исчерпаемы, человеку нужно ответственно подходить к их использованию",
                },
                {
                    id: 2,
                    text: "Экология важнее всего",
                },
                {
                    id: 3,
                    text: "Человечество губит окружающую среду",
                },
            ],
        },
    ],
    3: [
        {
            id: 1,
            title: "Сколько сотрудников работает в ФосАгро?",
            correct: 2,
            wrongAnswerSectId: 4,
            items: [
                {
                    id: 1,
                    text: "Менее 5 тыс. сотрудников",
                },
                {
                    id: 2,
                    text: "Более 1 тыс. сотрудников",
                },
                {
                    id: 3,
                    text: "Менее 50 тыс сотрудников",
                },
                {
                    id: 4,
                    text: "Более 18 тыс. сотрудников",
                },
            ],
        },
        {
            id: 2,
            title: "Какая программа помогает расширять контакты со студентами, заинтересованными в работе в Группе «ФосАгро»?",
            correct: 2,
            wrongAnswerSectId: 4,
            items: [
                {
                    id: 1,
                    text: "«Молодые трудолюбивые специалисты»",
                },
                {
                    id: 2,
                    text: "АНО «ДРОЗД»",
                },
                {
                    id: 3,
                    text: "«Молодые талантливые специалисты»",
                },
                {
                    id: 4,
                    text: "Адресная помощь",
                },
                {
                    id: 5,
                    text: "«Молодые умные студенты»",
                },
            ],
        },
        {
            id: 3,
            title: "Какие документы ФосАгро регламентируют соблюдение прав человека?",
            correct: 2,
            wrongAnswerSectId: 4,
            items: [
                {
                    id: 1,
                    text: "Кодекс корпоративного управления",
                },
                {
                    id: 2,
                    text: "Стратегия-2025",
                },
                {
                    id: 3,
                    text: "Политика управления персоналом",
                },
                {
                    id: 4,
                    text: "Кодекс этики",
                },
                {
                    id: 5,
                    text: "Заявление о прозрачности Компании в отношении Закона Великобритании «О современном рабстве",
                },
            ],
        },
        {
            id: 4,
            title: "Как называется единственный в России сертификат, признанный на международном уровне Всемирной ассоциацией экомаркировки (GEN)?",
            correct: 2,
            wrongAnswerSectId: 4,
            items: [
                {
                    id: 1,
                    text: "ня",
                },
                {
                    id: 2,
                    text: "Химия для жизни на земле",
                },
                {
                    id: 3,
                    text: "Зеленый урожай",
                },
                {
                    id: 4,
                    text: "Зеленые удобрения для роста",
                },
                {
                    id: 5,
                    text: "Зеленая химия для жизни",
                },
            ],
        },
        {
            id: 5,
            title: "Сколько к 2030 году ФосАгро планирует разработать и вывести на рынок марок новых удобрений?",
            correct: 2,
            wrongAnswerSectId: 4,
            items: [
                {
                    id: 1,
                    text: "50",
                },
                {
                    id: 2,
                    text: "20",
                },
                {
                    id: 3,
                    text: "70",
                },
                {
                    id: 4,
                    text: "40",
                },
            ],
        },
    ]
}

export default { finalData, testsQsData }
